---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipingSystem.IsWellConnected
source: html/cfeb4015-ae73-b0f7-fe1c-f8b603ff446e.htm
---
# Autodesk.Revit.DB.Plumbing.PipingSystem.IsWellConnected Property

Indicates if the system is well connected or not.

## Syntax (C#)
```csharp
public bool IsWellConnected { get; }
```

## Remarks
If the system is not well connected, parameters which need to be calculated are invalid.